namespace Episode001

// Учитывая что в курсе было много теории и мало практики эпизоды 001,002,003 совмещены в один проект.



{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Привет, Мир! Давно не виделись)))) ");
            Console.WriteLine("Было много теории, мало практики ))) ");


        }
    }
}


// Домашнее задание: сделать программу которая выводит на экран приветствие из фильма Матрица. Цвет шрифта должен быть зеленым, а фон черным. Сообщения должны пропадать
// и появляться сами с задержкой.